## Part 1

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('cars.csv') ### import the dataset

In [4]:
df.shape[0] ### number of row

428

In [5]:
df.shape[1] ### number of columns

19

In [6]:
df.cylenders.unique()

array([ 4,  6,  3,  8,  5, 12, 10, -1], dtype=int64)

In [7]:
len(df.cylenders.unique()) ### number of unique cyclender values

8

In [8]:
df.horsepower.mean() ### average horsepower of cars

215.8855140186916

In [9]:
df.horsepower.max() ### max horsepower of cars

500

In [10]:
df[df.Price == df.Price.max()][['name','Price']]

                    name   Price
287  Porsche 911 GT2 2dr  192465

In [11]:
df = df.rename(columns={"name": "car_name"})
df.head()

,car_name,sports_car,suv,wagon,minivan,pickup,all_wheel,rear_wheel,Price,Dealer_Cost,Engine_size,cylenders,horsepower,city_miles_per_galloon,highway_miles_per_Gallon,weight,base_wheeel,length,width
0,Chevrolet Aveo 4dr,False,False,False,False,False,False,False,11690,10965,1.6,4,103,28.0,34.0,2370.0,98.0,167.0,66.0
1,Chevrolet Aveo LS 4dr hatch,False,False,False,False,False,False,False,12585,11802,1.6,4,103,28.0,34.0,2348.0,98.0,153.0,66.0
2,Chevrolet Cavalier 2dr,False,False,False,False,False,False,False,14610,13697,2.2,4,140,26.0,37.0,2617.0,104.0,183.0,69.0
3,Chevrolet Cavalier 4dr,False,False,False,False,False,False,False,14810,13884,2.2,4,140,26.0,37.0,2676.0,104.0,183.0,68.0
4,Chevrolet Cavalier LS 2dr,False,False,False,False,False,False,False,16385,15357,2.2,4,140,26.0,37.0,2617.0,104.0,183.0,69.0

## Part 2

In [13]:
car_pricing = df.loc[:,['car_name','Price']]
car_pricing.head()

                      car_name  Price
0           Chevrolet Aveo 4dr  11690
1  Chevrolet Aveo LS 4dr hatch  12585
2       Chevrolet Cavalier 2dr  14610
3       Chevrolet Cavalier 4dr  14810
4    Chevrolet Cavalier LS 2dr  16385

In [14]:
def pricing_category(price):
    if price < 20000:
        return 'Budget Car'
    elif price >= 20000 and price <= 35000:
        return 'Suitable Car'
    else:
        return 'Expensive Car'

In [15]:
car_pricing['category'] = np.nan
car_pricing

                            car_name  Price  category
0                 Chevrolet Aveo 4dr  11690       NaN
1        Chevrolet Aveo LS 4dr hatch  12585       NaN
2             Chevrolet Cavalier 2dr  14610       NaN
3             Chevrolet Cavalier 4dr  14810       NaN
4          Chevrolet Cavalier LS 2dr  16385       NaN
..                               ...    ...       ...
423         Nissan Titan King Cab XE  26650       NaN
424                      Subaru Baja  24520       NaN
425                    Toyota Tacoma  12800       NaN
426     Toyota Tundra Regular Cab V6  16495       NaN
427  Toyota Tundra Access Cab V6 SR5  25935       NaN

[428 rows x 3 columns]

In [16]:
for i in range(len(car_pricing)):
    car_pricing['category'][i] = pricing_category(car_pricing['Price'][i])

C:\Users\thanh\AppData\Local\Temp\ipykernel_8664\239739564.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  car_pricing['category'][i] = pricing_category(car_pricing['Price'][i])
C:\Users\thanh\AppData\Local\Temp\ipykernel_8664\239739564.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'Budget Car' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  car_pricing['category'][i] = pricing_category(car_pricing['Price'][i])

In [17]:
car_pricing

                            car_name  Price      category
0                 Chevrolet Aveo 4dr  11690    Budget Car
1        Chevrolet Aveo LS 4dr hatch  12585    Budget Car
2             Chevrolet Cavalier 2dr  14610    Budget Car
3             Chevrolet Cavalier 4dr  14810    Budget Car
4          Chevrolet Cavalier LS 2dr  16385    Budget Car
..                               ...    ...           ...
423         Nissan Titan King Cab XE  26650  Suitable Car
424                      Subaru Baja  24520  Suitable Car
425                    Toyota Tacoma  12800    Budget Car
426     Toyota Tundra Regular Cab V6  16495    Budget Car
427  Toyota Tundra Access Cab V6 SR5  25935  Suitable Car

[428 rows x 3 columns]

In [18]:
car_cat=['Budget Car','Suitable Car','Expensive Car']
for i in range(len(car_cat)):
    print(car_cat[i], car_pricing[car_pricing.category==car_cat[i]].count())

Budget Car car_name    98
Price       98
category    98
dtype: int64
Suitable Car car_name    193
Price       193
category    193
dtype: int64
Expensive Car car_name    137
Price       137
category    137
dtype: int64